; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 198979 2 1 2 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	image1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
)
(:goal (and
	(pointing satellite1 Phenomenon8)
	(have_image Phenomenon7 infrared0)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 infrared0)
	(have_image Star10 image1)
	(have_image Planet11 infrared0)
	(have_image Phenomenon12 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite1 phenomenon8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 7
3. (turn_to satellite0 star6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star6)
   goals met: 1 of 7
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
5. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 1 of 7
6. (turn_to satellite1 star6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star6)
   goals met: 0 of 7
7. (turn_to satellite0 star10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star10)
   goals met: 0 of 7
8. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 7
9. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 1 of 7
10. (turn_to satellite1 phenomenon8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 7
11. (turn_to satellite0 planet11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet11)
   goals met: 2 of 7
12. (take_image satellite1 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 3 of 7
13. (take_image satellite0 planet11 instrument0 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 4 of 7
14. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 7
15. (turn_to satellite0 phenomenon7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 7
16. (take_image satellite1 phenomenon9 instrument1 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 4 of 7
17. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 7
18. (take_image satellite0 phenomenon7 instrument0 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 6 of 7
19. (turn_to satellite0 phenomenon12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon12)
   goals met: 6 of 7
20. (take_image satellite0 phenomenon12 instrument0 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 7 of 7
